In [1]:
import pandas as pd
import numpy as np
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine

# ERD

![png](https://assets.codingdojo.com/boomyeah/company_209/chapter_3569/handouts/chapter3569_5431_sakila-db-model.png)

In [2]:
#create connection string
username='root'
password='Hjtsai$$1031'
db_name='sakila'
connection=f'mysql+pymysql://{username}:{password}@localhost/{db_name}'

In [3]:
#create an engine
engine=create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

# First Query

What query would you run to get all the customers inside city_id = 312? Your query should return the customers' first name, last name, email, address, and city.

In [5]:
q = """SELECT customer.first_name, customer.last_name, 
customer.email, address.address, address.address2, city.city
FROM city
JOIN address ON city.city_id = address.city_id
JOIN customer on address.address_id = customer.address_id
WHERE city.city_id = 312;"""
pd.read_sql(q, engine)

,first_name,last_name,email,address,address2,city
0,MATTIE,HOFFMAN,MATTIE.HOFFMAN@sakilacustomer.org,1497 Yuzhou Drive,,London
1,CECIL,VINES,CECIL.VINES@sakilacustomer.org,548 Uruapan Street,,London

# Second Query

What query would you run to get all comedy films? Note that the genre is called the category in this schema. Your query should return film title, description, release year, rating, and special features.

# Third Query

What query would you run to get all the films that Johnny Lollobrigida was in? Your query should return the actor's last name, film title, and release year.

# Fourth Query

What query would you run to get the first and last names of all the actors in the movie titled "Bingo Talented"?

# Fifth Query

What query would you run to get the customer_id associated with all payments greater than twice the average payment amount? (HINT: use 2* in your query to get twice the amount). Your result should include the customer id and the amount.

# Sixth Query

What query would you run to list the first and last names of the 5 customers who have the highest number(count) of payments? You can title the number of payments as num_payments.